ProyectoMateriaDAW/app/Controllers/AdminController.php

    public function clientes_lista()
    {
        $clienteModel = new ClienteModel();
        $data['clientes'] = $clienteModel->findAll();  // Esto obtendrá todos los clientes de la base de datos
---
SELECT *
FROM `clientes`